In [1]:
import pandas as pd

In [2]:
df6 = pd.read_excel('Data.xlsx', sheet_name = 'Day 6')

In [3]:
df6

   customer_id customer_name  amount_spend
0            1         Ankit         10000
1            2        Danish          7000
2            3       Charlie          5000
3            4           Eve          9000
4            5         David          8000

In [5]:
df6['bonus'] = 0

In [6]:
df6

   customer_id customer_name  amount_spend  bonus
0            1         Ankit         10000      0
1            2        Danish          7000      0
2            3       Charlie          5000      0
3            4           Eve          9000      0
4            5         David          8000      0

In [7]:
df6.loc[(df6['customer_id'] % 2 == 1) & (df6['customer_name'].str[0] != 'D'), 'bonus'] = df6['amount_spend'] * 0.10

In [8]:
df6

   customer_id customer_name  amount_spend  bonus
0            1         Ankit         10000   1000
1            2        Danish          7000      0
2            3       Charlie          5000    500
3            4           Eve          9000      0
4            5         David          8000      0

In [9]:
df7 = pd.read_excel('Data.xlsx', sheet_name = 'Day 7')

In [10]:
df7

   customer_id    name
0            3   dAvid
1            1  SaChin
2            2   viRAT
3            5  Akshay
4            4   raHul

In [11]:
df7['name'] = df7['name'].str.capitalize()

In [12]:
df7

   customer_id    name
0            3   David
1            1  Sachin
2            2   Virat
3            5  Akshay
4            4   Rahul

In [13]:
output = df7.sort_values(by='customer_id')

In [14]:
output

   customer_id    name
1            1  Sachin
2            2   Virat
0            3   David
4            4   Rahul
3            5  Akshay